  {
"1": "Theo Abhidhamma thì ý (mano), thức (viññāṇa), tâm (citta)... đồng nghĩa; nhưng tôi chọn dịch là tư tác (cetanā) – vì tư tác mới là nghiệp. Từ trước đến nay, nhiều nơi bảo tác ý (manasikāra) là nghiệp; không phải vậy, tác ý mới chỉ là hướng tâm, như bánh lái của chiếc thuyền. Trong 7 biến hành tâm sở (Duy Thức chỉ 5): Xúc, tác ý, thọ, tưởng, tư, nhất tâm, mạng căn – thì chính tư (tư tác-cetanā) mới quan trọng, mới tạo nghiệp; sau đó, các lộ trình tâm mới khởi theo – chúng đồng khởi. Tuy nhiên, nếu dịch là tâm hay ý đều không sai, vì ý, tâm, tư tác - được coi là tâm và các pháp (dhammā), hai từ đầu trong câu kệ, chính là những tâm sở (theo chú giải).",
"2": "Câu Pāli tương ứng có nghĩa: Sống mà hằng suy nghĩ đến lạc thú (nhìn tịnh tướng).",
"3": "Kiết thừng: Dây trói buộc.",
"4": "Trú xứ ẩn mật của Thức.",
"5": "Ngũ ma.",
"6": "Ý nói về dục vọng.",
"7": "Tuệ minh sát",
"8": "Không ái luyến, không đeo níu những bậc thiền đã đạt được; an trú trạng thái ly tham, vô ái, Niết-bàn.",
"9": "Kinh pháp cú, kinh lời vàng, Phật ngôn, bát chánh đạo, giáo pháp.",
"10": "Từ Tu-đà-hoàn đến A-na-hàm.",
"11": "Hàm chỉ bậc Thánh.",
"12": "Hàm chỉ bậc Thánh.",
"13": "Ngôi nhà ngũ uẩn.",
"14": "Ái (Taṅhā)",
"15": "Thân (Kāya)",
"16": "Phiền não (Kilesa)",
"17": "Chú giải nói, ba canh là ba giai đoạn của đời người: Thiếu, trung và lão.",
"18": "Magga: Đạo.",
"19": "Cuộc chiến thắng tham, sân, si.",
"20": "Mọi vết tích của hữu vi, phiền não.",
"21": "10 Phật lực, 9 hồng danh.",
"22": "Giải thoát ngoài 3 cõi, không còn dấu vết tâm hành.",
"23": "Saṅkhāra: Hành trong 12 duyên khởi, trong ngũ uẩn.",
"24": "Cần phân biệt một số từ có từ gốc “Ái”, đó là piya, pema, rati, rāgī, rāga, kāma, taṇhā... Piya, pema thường dùng trong nghĩa thương yêu, trìu mến, thân yêu, thương mến, yêu quý, yêu mến... là những tình cảm tốt đẹp trong đời thường như cha mẹ, vợ con, bằng hữu, xóm làng, quê hương... Rati, rāgī, rāga được dùng khi tình cảm đã sâu nặng, như quyến luyến, luyến thương, ái luyến đưa đến dục tình, tình dục... Kāma thì thuộc về tất cả dục ngũ trần, thuộc dục giới. Taṅhā là ái, ái dục nằm trong 12 duyên khởi; khi nó thích thì yêu, thương, tham - khi không thích thì sinh ra ghét, chán, sân. Tuy nhiên, dù thương, dù ái kiểu gì thì cũng đem đến buộc ràng, đau khổ... như tham, thương nhiều thì khổ nhiều; tham, thương ít thì khổ ít vậy (Đây là sự thấy biết riêng, có tính chủ quan của soạn giả, có thể chưa được chính xác hoặc có một vài sai sót nào đó, xin các bậc thức giả, trí giả hiểu cho).",
"25": "Piya: Thân yêu, yêu quý, thương mến...(có từ gốc Ái dục – taṇhā); nó là tình thường trong đời sống, chưa quá đà, chưa có tội lắm, nhưng cũng phát sanh khổ.",
"26": "Pema: Thương yêu, trìu mến...; cũng có từ gốc taṇhā – ái dục; là tình cảm tốt trên cuộc đời như thương vợ, thương con; chưa có tội lắm nhưng cũng đưa đến phiền não.",
"27": "Rati: Luyến ái, phát sanh dục tình – có từ gốc Ái dục - taṇhā, từ đây mới phát sanh vấn đề cần phải được nhìn ngắm. Cao hơn một cấp độ nữa là Rāga: Tình dục, gốc của luân hồi.",
"28": "Kāma: Tham muốn thoả mãn ngũ dục, nói chung là cõi dục giới, có từ gốc Ái dục - taṇhā.",
"29": "Taṇhā: Ái Dục, nằm trong 12 duyên khởi, gốc của sinh tử luân hồi. Từ Taṇhā này, cái gì được thì tham, thương; cái gì không được thì sân, ghét.",
"30": "Chỉ Niết-bàn.",
"31": "Chỉ 3 quả vị đầu là Tu-đà-hoàn, Tư-đà-hàm, A-na-hàm.",
"32": "Chỉ A-la-hán.",
"33": "Ý nói là tự chôn gốc rễ của mình mãi mãi trên thế gian này, không bao giờ lìa thoát được.",
"34": "Adhammo: Phi pháp, nghịch nghĩa với pháp; nghĩa là không đi theo giáo pháp – nhưng chú giải cho nghĩa là sân hận vì tham và sân là căn nguyên của điều ác.",
"35": "Saṅkhāra: Tôi dịch là hành chứ không dịch là hữu vi – vì tâm hành là tâm lăng xăng tạo tác, nó ở trong 12 duyên khởi; còn hữu vi là thường chi tất cả các pháp được kết hợp, cấu tạo của thế giới gồm chung tinh thần, vật chất, của sum la vạn tượng.",
"36": "Mogha: Rỗng không; jiṇṇa: già lão, già yếu... Nên có thể dịch là “lão ngu” hoặc “lão già vô vị”; nhưng tôi dịch là “sư già rỗng tuếch” là đúng với ý của sự khiển trách trong câu này.",
"37": "Ariya: Cao quý, cao thượng, quý phái... mà cũng có nghĩa là bậc thánh nhân.",
"38": "Dassanassa visuddhiyā: Với cái thấy thanh tịnh (Tri kiến thanh tịnh).",
"39": "Người thực hành bát chánh đạo.",
"40": "Hai đàng: Rõ thông định và tuệ; tham và sân; thiền sắc giới và vô sắc giới; hữu (hữu ái), phi hữu (phi hữu ái).",
"41": "Rừng dục vọng.",
"42": "Theo chú giải, khi đức Phật dạy “hãy đốn rừng”, có một số vị tỳ-khưu hiểu theo nghĩa đen, nên ngài phải nói tiếp là “không chặt cây” – vì rừng là rừng dục vọng, không phải là rừng cây thật.",
"43": "Dục, nhiễm ô lớn nhỏ.",
"44": "Không còn dục vọng, nhiễm ô.",
"45": "Bát chánh đạo.",
"46": "Việc thích đáng: Như giới, định, tuệ.",
"47": "Việc không thích đáng: Chăm sóc cái thân, trang trí y bát, dù dép; lo việc ở ngoài đời...",
"48": "Mātu: Mẹ, tiêu biểu cho tâm ái dục (taṇhā); pitu: Cha, tiêu biểu cho ngã mạn, cố chấp, cứng đầu, kiêu căng, tự phụ, hống hách... ",
"49": "Hai vua: Thường kiến và đoạn kiến.",
"50": "Người phụ trách kho tàng của vương quốc – ý nói cái tâm ái luyến bám bíu vào đời sống.",
"51": "Ý nói lục căn và lục trần.",
"52": "Là năm chướng ngại tinh thần (5 triền cái): Hôn trầm, thuỵ miên, nghi; sân ác; trạo hối; tham dục.",
"53": "Gia tài thánh hạnh.",
"54": "Cơ hội: Có Phật đản sanh, có giáo pháp, có thiện trí thức, có chánh kiến, có nơi ở thuận lợi, có ngũ quan đầy đủ, thân thể khoẻ mạnh",
"55": "Tự tu, tự hành thập độ để huân tụ pháp lành.",
"56": "Ái dục (taṇhā): 6 ái dục có từ 6 căn; 6 ái dục có từ 6 trần - tức là 12 ái dục; cộng với 3 thời quá khứ, hiện tại, vị lai thành ra 36 loại ái dục.",
"57": "6 căn ái tham, hỷ tham ngũ trần.",
"58": "Thằng là sợi dây; thúc là bó buộc.",
"59": "Đạt tuệ phân tích, tứ vô ngại giải.",
"60": "Năm hạ phần kiết sử: Thân kiến, hoài nghi, giới cấm thủ, tình dục, bất bình.",
"61": "Năm thượng phần kiết sử: Sắc ái, vô sắc ái, ngã mạn, phóng tâm, vô minh.",
"62": "Ngũ căn, ngũ lực: Tín, tấn, niệm, định, tuệ.",
"63": "Tham, sân, si, mạn, tà kiến.",
"64": "Trong phẩm nầy, từ brāhmaṇa (bà-la-môn) đồng nghĩa với samaṇa (sa-môn) đều là bậc thanh tịnh, vắng lặng - ở đây đức Phật muốn chính danh lại nghĩa đúng đắn của một bà-la-môn chơn chánh, do vào thời ấy, giới bà-la-môn đã hành trì quá sai lạc.",
"65": "Là một cách phiên âm khác của brāmaṇa.",
"66": "Tà kiến",
"67": "Sân hận",
"68": "Luyến ái.",
"69": "Tuỳ miên kiết sử và vô minh.",
"70": "Vũng lầy tham ái.",
"71": "Con đường dục vọng.",
"72": "Vòng luân hồi trầm luân sinh tử.",
"73": "Xuyên qua, vượt thoát 4 dòng lũ: Dục lậu đưa đến dục bạo lưu (kāmogho); hữu lậu đưa đến hữu bạo lưu (bhavogho); kiến lậu đưa đến kiến bạo lưu (diṭṭhogho); vô minh đưa đến vô minh bạo lưu (avijjogho).",
"74": "Ưa thuộc tham, ghét thuộc sân; tham sân là gốc của ái (taṇhā).",
"75": "Nương tựa mà sanh khởi, bám víu vào đời sống",
"76": "Loka: Thế gian, nội giới cũng như ngoại giới; ở đây hàm chỉ ngũ uẩn."
  }
