  {
"1": "Những pháp yếu được diễn nói theo cách song đối.",
"2": "Pháp tức là Dhamma. Ở đây chỉ về pháp bất thiện, ở câu thứ hai chỉ về pháp thiện.",
"3": "Nguyên văn: Cakkam va vahato padam, nên dịch là: “Như bánh xe lăn theo chân con thú kéo xe”.",
"4": "Nguyên văn: Sanantano, có nghĩa là đời xưa. Cổ pháp (Sanantano Dhamma, hoặc Paranako Dham-ma) tức chỉ cho tất cả pháp tắc vĩnh cửu bất dịch mà chư Phật và đệ tử quá khứ đã gìn giữ và truyền dạy.",
"5": "Chỉ người tranh luận. Nhân khi Phật ở Kỳ đà lâm, đối với các vị Tỷ-kheo ưa tranh luận tại Câu sanh bì (Kosambi)ù mà nói kinh này, nên có sự xưng hô đó.",
"6": "Nguyên văn: Mayametthayamamasa, ý nói thẳng thì “chúng ta sắp bị diệt vong vì luật vô thường”.",
"7": "Tự cho thân mình trong sạch rồi đắm ưa hoài.",
"8": "Ma vương (Mara) ở đây chỉ tình dục.",
"9": "Chẳng khoái lạc (asubha) chỉ phép bất tịnh quán, như quán thân với 32 điều bất tịnh v.v...",
"10": "Chỉ tham dục v.v...",
"11": "Như bốn thứ tư cụ là áo, cơm, thuốc uống, nhà ở và mười thứ tà kiến v.v...",
"12": "Như giới, định, huệ và chánh kiến v.v...",
"13": "Do tạo ác nghiệp mà đưa đến sự bi ai trong đời này gọi là “Buồn tôi đã tạo ác”. Nhưng mà nỗi bi ai này còn có hạn chứ tương lai đọa vào ác đạo thọ báo lâu dài, cái khổ này mới vô cùng.",
"14": "Kẻ chăn bò thuê cứ sáng sớm dắt bò ra đồng, tối lại lùa bò về chuồng giao cho chủ, ngày ngày chỉ đếm bò mà đổi lấy ít tiền công, còn sữa, lạc, sanh tô, đề hồ của bò thì anh ta không hưởng được. Tụng kinh mà không tu hành theo kinh thì chẳng hưởng được lợi ích của kinh, của kẻ tu hành.",
"15": "Niết-bàn (Nibbàna)",
"16": "Bởi vì người không buông lung thì được chứng nhập Niết-bàn và không còn luân hồi sanh tử tiếp nối nữa. Còn người buông lung tuy sống mà vẫn như thây chết, không biết hướng thiện, nỗ lực làm lành.",
"17": "Bài này tiếp bài trên, khuyên đừng nên phóng dật mà gắng chuyên cần.",
"18": "Cảnh giới của chư Phật, Bích chi và A-la-hán.",
"19": "Muốn chứng đặng Niết-bàn thì phải trừ 4 ách: dục ách (Kamayogo sự tham dục), hữu ách (Bha-vayogo mê chấp ba cõi), kiến ách (Ditthiyogo điều tà kiến, ác kiến), vô minh ách (Avijjayogo sự mê mờ).",
"20": "Như cõi đất cao có thể tránh khỏi thủy tai. Kẻ trí khi chứng được A-la-hán thì không còn bị phiền não quấy nhiễu, nhận chìm.",
"21": "Các phiền não tham, sân, si buộc ràng và sai sử chúng sanh trong vòng ba cõi.",
"22": "Ma-già (Maghavà) tên khác của trời Đế Thích (Sarka) khi chưa đủ phúc báo để làm trời, Đế Thích ở nhân gian tên là Ma-già, nhờ công đức siêng năng quét tước sạch sẽ mà được làm chủ cõi chư Thiên.",
"23": "Kiết sử (Samyojana) tức là phiền não (Kilesa) danh từ chuyên môn nhà Phật.",
"24": "Mấy câu này đều hình dung cái tâm.",
"25": "Khi chứng được A-la-hán thì vô lậu thiện nghiệp viên mãn, hữu lậu ác nghiệp và hữu lậu thiện nghiệp đã hết rồi, không còn tạo nghiệp mới nữa, và tuy ở trong đạo quả viên mãn mà thường làm những việc lợi tha một cách tự nhiên.",
"26": "Kết quả thắng lợi là chỉ có cảnh giới Thiền định được tiến bộ.",
"27": "Không nên nhiễm trước vào Thiền cảnh đã chứng được, phải nỗ lực cầu tiến mãi.",
"28": "Phật giáo đồ các nước Phật giáo nam phương mỗi khi lâm chung có lệ thỉnh chư Tăng đến để cúng dường làm phước lần chót. Chư Tăng liền tụng bài bài kệ này ba biến.",
"29": "Đem tâm hướng về 10 hạnh ác (Akusala): sát sinh (Panatipato), thâu đạo (Adinnadanam), tà dâm (Kamesumicchacara), vọng ngữ (Musavado), lưỡng thiệt (Pisunavaca), thô ác ngữ (Pharusava-ca), ỷ ngữ (samphap palapo), tham (abhijjha), sân (Viyapado), tà kiến (Micchadithi).",
"30": "Đem tâm hướng về 10 hạnh lành (Kusala): cúng dường (Danam), trì giới (Silam), tu thiền định (Bhavana), tôn kính (Apacaijannam), tác sự ( Vey-yavaccam), hồi hướng công đức (Pattidacam), tùy hỷ công đức (Pattanumodana), thính pháp (Dham-musavanam), thuyết pháp (Dhammadesana), chánh kiến (Dithujjukamman).",
"31": "Ngài Ngô Chi Khiêm dịch là Phẩm Vương Hoa.",
"32": "Chinh phục (Vijessati), là theo Pali nguyên chú. Bản chú thích kinh Pháp cú rất xưa và đầy đủ chi tiết bằng văn bản Pali của Ngài Buddahaghosa, căn bản của các lời chú thích sau này. Bản do E.W.Burlinghame dịch ra Anh văn trong loại sách Harvard Oriental serie là hiểu xác thật. Bản ở Miến Điện chép là vicessati, thì nên dịch là “chọn tìm” hoặc “dò xét ”.",
"33": "Địa giới (Pathavi) là chỉ tự kỷ hay tự thân (Atta-bhava). Bản Dhammapada Anh văn của Đại đức Narada dịch, trang 8, có chú thích rằng: “This is one who will understand this self as if really is”. câu này có nghĩa “như thật tự biết rõ mình”.",
"34": "Diêm ma giới (Yamalokà), theo nguyên chú thì bao quát cả 4 giới (Catudbhidam apayalokan ca): địa ngục, ngạ quỉ, súc sanh và a-tu-la (Asura). Bản chú thích bằng Anh văn của Ngài Narada nói: “The fourwoeful states, viz: Hell (địa ngục), Animal kingdom (súc sanh), Peta realm (ngạ quỉ) and the Asura realm(A-tu-la)”.",
"35": "Thiên giới (Sadevakam), theo nguyên chú thì bao quát 6 cõi trời dục giới và nhân giới (Imamsade- Vakanit mannussalokanca). Ngài Narada chú: “ Namely the world of human beings and the six celestial realm’s”.",
"36": "Pháp cú (Dhammapada tức là pháp tích, pháp, như ba mươi bảy đạo phẩm (Bodhipakkhikadham-ma) v.v...",
"37": "Thợ khéo là thợ làm tràng hoa, để ví dụ cho người khéo giảng nói Pháp cú, có lớp lang, không lộn xộn, như thợ xâu hoa vậy.",
"38": "Hữu học (Sekha) tức là các vị chứng sơ quả Tu đà hoàn (Sotapattiphala), nhị quả Tư đà hàm (Sa-kadagamiphala), tam quả A na hàm (Anagam-phala), và sơ quả hướng, nhị quả hướng, tam quả hướng, tứ quả hướng, vì những vị này còn phải học tập giới, định, huệ. Đến khi chứng tứ quả A-la-hán mới được gọi là Vô học (Asekha).",
"39": "Bài tụng trên là hỏi, bài này đáp.",
"40": "Sự dụ hoặc của dục cảnh.",
"41": "Những người đang say ngủ trong xóm làng giữa đêm khuya, bị nước lũ cuốn đi mà không hay biết gì. Người mê miết trong dục lạc cũng vậy.",
"42": "Cảnh dục lạc.",
"43": "Mâu-ni (Muni) có nghĩa là người trầm lặng, nhân từ, trí tuệ, thánh giả, ở đây chỉ hàng Sa-môn khất thực.",
"44": "Nguyên văn của câu này là “Naparesam kataka-tam” dịch thẳng là “Chẳng nên dòm ngó người khác làm hay không làm”.",
"45": "Chiên-đàn-na (Candana) Đa-gia-la (tagara), tên hai thứ cây thơm, Mạt-lị-ca (Malika) là một thứ hoa nhỏ thơm mọc tùm lum như giây bìm.",
"46": "Bạt-tất-kỳ (Vassiky) là vũ quý hoa.",
"47": "Luân hồi (samsara) chỉ sự sanh tử luân chuyển mãi không ngừng.",
"48": "Thọ quả báo lành dữ trong tương lai tức là thân dị thục (vipaka) ở đây chỉ riêng ác quả.",
"49": "Đây chỉ thiện quả.",
"50": "Cô-sa (kusa) tên cỏ thơm, nguyên văn là Kusag-gena, tức là dùng đầu ngọn cỏ cô-sa.",
"51": "Người tư duy Chánh pháp (Sankhata dhamman) là người thâm nhập Chánh pháp, đây là người giác ngộ Tứ đế.",
"52": "Muốn sữa đông đặc thành đề hồ không phải một ngày một đêm mà đông được kịp.",
"53": "Trong Hán văn chữ này cũng gọi là đầu thủ, đầu não.",
"54": "Bản chữ Nhật dịch là Hiền phẩm.",
"55": "Người không còn điều ác ở thân khẩu ý nữa, chuyên việc tế độ chúng sanh.",
"56": "Chư Phật và A-la-hán.",
"57": "Khắc chế năm căn đừng cho thấy, nghe, ngửi, nếm, xúc điều quấy.",
"58": "Cảnh giới Niết-bàn.",
"59": "Cảnh giới sanh tử.",
"60": "Cảnh giới sanh tử. Câu này ý nghĩa liên quan với câu trên.",
"61": "Giác chi (Sambodhiyangam) là thất Bồ đề phần hay là “thất giác chi” là: niệm giác chi (Satisanm-bojjhango), trạch pháp giác chi (Dhammavicayas-shojjhango), tinh tấn giác chi (Viriyasambojjhan-go), hỷ giác chi (Pitisam bojjhango), khinh an giác chi (Passadhisambojjhango), định giác chi (Sama-dhisambojjhango), xả giác chi (Upekhasambojjha-ngo).",
"62": "Chứng được Niết-bàn, giải thoát tự tại.",
"63": "Nguyên văn: Khinasava, dịch nghĩa là “Dứt hết các lậu” hoặc “các lậu đã sạch hết ”, tức là dứt hết mọi phiền não.",
"64": "A-la-hán (Arahant) tức là bậc thánh đã dứt hết phiền não, chứng Niết-bàn, không bị sanh tử nữa.",
"65": "Trói buộc (Gantha) có bốn thứ: Tham (Abhijjha), sân (Vijjapada), giới cấm thủ (Sibbhataparomasà), kiến thủ (Idan saccabhinivesa).",
"66": "Con đường hữu vi lậu nghiệp đã đi cùng. Có chỗ gọi là “các lậu đã dứt sạch, việc tu hành đã xong, phạm hạnh đã thành lập”.",
"67": "Con ngỗng mỗi khi ra khỏi ao thì chẳng còn nghĩ tưởng đến mồi, cỏ, nước trong ao là của mình. Vị A-la-hán đã xuất gia rồi thì không còn luyến tưởng tới gia tài của cải nữa.",
"68": "Chẳng còn hoạt động theo nghiệp lực.",
"69": "Biết rõ sự ăn uống là cốt để duy trì tánh mạng mà tu hành.",
"70": "Chứng được Niết-bàn gọi là giải thoát (Vimokha); lại gọi là không (Sinnàta), vì không còn tham, sân, si, phiền não; lại gọi là vô tướng (Animitta) vì từ nay đã được tự tại không còn đắm trước tưởng tham dục.",
"71": "Lậu có bốn thứ: dục lậu (Kamasava), hữu lậu (Bhavasava), kiến lậu (Ditthasava), vô minh lậu (Avijjasava).",
"72": "Nhân-đà-yết-la (Indakhila), nhiều bản dịch là môn hạn (chấn cửa) tức là đặt một tảng đá giữa chổ cửa lớn, dùng chấn then cửa để đóng cho chắc. Có một chỗ nói indakhila theo Phạn tự là indra-khila tức là cái trụ của Nhân đà la (Đế thích). Ở tại chỗ tiến vào thành, dựng một cái trụ lớn để tượng trưng chỗ ở của Nhân đà la (thần bảo hộ của dân Ấn Độ). Chính ngày xưa đã dịch là cái tràng kiên cố, là bảy tràng Đế Thích, là đài tọa.",
"73": "Vô tín (Assaddha) hoặc dịch là bất tín, ý nói vị Thánh nhân tự mình chứng biết chứ không phải do ai làm cho giác ngộ.",
"74": "Các nghiệp thiện, nghiệp ác trong vòng hữu lậu thế gian.",
"75": "Sanh tử luân hồi.",
"76": "Nguyên văn chép: Nina là chỗ thấp, Thala là chỗ cao.",
"77": "Theo bản Tích Lan thì chữ này là Dhammapada nên dịch là “Pháp cú” nhưng theo bản của “Hiệp hội xuất bản Pali thánh điển” thì chép là Gathapada, chữ này nên dịch là “nhất cú kệ”.",
"78": "Câu này liên quan với câu trên.",
"79": "Càn-thát-bà (Gandhàbha) tên một vị thần ở Thiên giới.",
"80": "Tên một vị Thiên thần.",
"81": "Phạm thiên tức là Bà-la-môn thiên (Brahma).",
"82": "Nguyên văn: “Yitthamva hutamva”, nghĩa là cúng hy sinh, là tế tự, là cúng dường, v.v... Đồng nghĩa là cúng dường trong hội hè, lễ tiết; hutam thì có nghĩa là dự bị cung cấp khách qua đường, hoặc làm việc cúng dường dựa theo một tín ngưỡng về tác nghiệp và quả báo mà mình tin tưởng.",
"83": "Chỉ tứ quả thánh nhân.",
"84": "Người tuổi cao đức trọng.",
"85": "Các tăng lữ ở các nước Nam phương, mỗi khi thọ người lễ kinh thì đọc bài tụng này.",
"86": "Năm uẩn sanh diệt tức là các phép do nhân duyên hòa hợp không thường trú.",
"87": "Nguyên văn: Mappamannatha có hai nghĩa: (a) Mappanati, là “chớ khinh thị”. (b) Mappamannati, là “chớ tưởng ít”.",
"88": "Đao trượng (Danda) cũng dịch là hình phạt.",
"89": "Chỉ vị A-la-hán đã sạch hết các lậu hoặc.",
"90": "Đây là một cách ngồi xổm, đặc biệt là người tu ngoại đạo xưa Ấn Độ, thường dùng để hành hạ xác thân.",
"91": "Bài này nói về cách tu khổ hạnh vô ích, không thể chứng được Niết-bàn.",
"92": "Trí và hành đầy đủ.",
"93": "Nói về sự già.",
"94": "Thế giới bị 11 thứ lửa này thường thiêu đốt: tham (raga), sân (dosa), si (moha), bệnh (vyad-hi), lão (jara), tử (marana), sầu (soda), bi (Pariv-eda), khổ (dukkha), ưu (domandsa), não (upya-sa).",
"95": "Ví vô minh.",
"96": "Dụ trí tuệ.",
"97": "Thân này do trên 300 đốt xương hợp thành.",
"98": "Chín chổ nơi thân: hai mắt, hai mũi, hai tai, miệng, đường đại, đường tiểu.",
"99": "Lầm nghĩ thân này mỹ lệ êm đềm.",
"100": "Hư ngụy (makkho), xưa dịch là che lấp (phủ)",
"101": "Chỉ Phật, Bích chi, La hán.",
"102": "Đây là lời đức Thích ca khi thành đạo, tâm sinh hoan hỷ mà nói ra. Sau này có lần nhân ngài A-nan hỏi nên Phật nói lại lời đó. Kẻ làm nhà chỉ nguyên nhân luân hồi, lòng tình dục, nhà là chỉ thân thể, rui mè là chỉ các thứ dục khác, kèo cột là chỉ vô minh.",
"103": "Thông thường nói ba thời là đầu đêm, giữa đêm, cuối đêm. Ở đây ba thời chỉ vào một đời người thanh niên, trung niên, lão niên. Người ta lúc thanh niên nên nỗ lực học tập, trung niên nên hoằng pháp, tu Thiền định v.v... Nhưng trong hai thời gian đó mà chưa kịp thích thời hành sự thì lúc lão niên phải tỉnh ngộ học tập gấp rút, nếu không thì luống uổng một đời, mang lấy thống khổ chẳng ích chi.",
"104": "Phật giáo chủ trương mỗi cá nhân phải tự lực lo giải thoát cho mình. Phật giáo đồ phát nguyện quy y phật, Pháp, Tăng, Tam Bảo, không có nghĩa là phát 1 lời cầu đảo để Tam Bảo lo giải thoát cho. Song Tam Bảo là thầy chỉ đạo tu hành đúng đường để được giải thoát. Vậy nên, muốn đến cảnh giới giải thoát tự tại thì tự mỗi người phải gắng sức thực hành đúng lời Tam Bảo chỉ dạy.",
"105": "Chỉ quả vị La hán.",
"106": "Mạn-la-phạm (Maluva) một loại dây bìm. Cây ta-la khi đã bị nó leo quấn vào thì khô chết ngay.",
"107": "Cách-tha-cách (Kattha), loại cây lau. Có tên là Cách-tha-cách trúc (Velusankhatakattha), hễ ra hoa kết trái rồi thì chết liền.",
"108": "Chỉ việc giải thoát sanh từ.",
"109": "Ở Tích Lan (Xri Lanca) giải thích là luân hồi.",
"110": "Sau khi đức Phật thành đạo, lần đầu Ngài trở về hoàng cung tại thành Ca-tỳ-la (Kapila), sáng hôm sau Ngài vẫn chiếu lệ mang bát đi khất thực. Vua Tịnh Phạn (Suddhodana) thấy vậy vội bước đến trước Phật mà nói rằng: “Này con ơi! Sao con làm nhục nhà ta vậy? Con vốn là chủ thành này, từng ở trên châu báu, nay cứ cầm bát lần đi từng nhà, không hổ nhục cho ta lắm sao?”. Đức Phật liền nói cho vua nghe đó là phép tắc lâu đời của chư Phật, và nói hai bài này. Nên theo chỗ chú giải xưa này thì hai bài này có nghĩa như sau: bài 168: “Chớ nhác bỏ việc lần theo từng nhà khất thực. Cẩn thận giữ thật đúng hạnh trì bát này, ai làm theo hạnh này thì đời này, đời sau đều khoái lạc”; bài 169: “Cẩn thận làm đúng hạnh này, chớ làm theo sự buông thả. Ai làm theo đúng hạnh này thì đời này, đời sau đều được khoái lạc “.",
"111": "Lầu sò chợ bể là dịch nghĩa từ chữ ”Thần lâu hải thị” để chỉ thị cảnh huyễn hóa không thật. Những làn khí bốc lên trên mặt biển, đụng phải ánh nắng, hoặc là không khí tương phản mà hiện ra những bóng hình nhìn xa như lâu đài chợ búa. Người xưa tin những làn khí ấy là hơi của giống sò thần tự dưới đáy bể phun lên.",
"112": "Nhất pháp (Ekham Dhanman) tức la chân đế, chân lý (Saccam).",
"113": "Dự lưu quả (Sotapattiphalam) là quả vị đầu trong bốn quả vị Niết-bàn Thanh văn.",
"114": "Hai bài này Phật đối Ma nữ mà nói.",
"115": "Ý toàn câu là “Cái tình dục đã bị chinh phục rồi, thì dù đang ở thế gian này, nó cũng không thể theo dõi người kia nữa”.",
"116": "Đã bỏ hết ái dục.",
"117": "Trong Tứ phần (giới bản) đức Như Lai Tỳ Bà Thi dạy: “Nhẫn nhục đệ nhất đạo, Phật thuyết vô vi tối, xuất gia não tha nhơn, bất danh vi Sa-môn”.",
"118": "Nguyên văn: Patimokkha tức là Biệt giải thoát luật nghi giới, gồm 227 giới điều chủ yếu mà tất cả Tỷ-kheo phải giữ.",
"119": "Chỉ tám định (Atthasalacattu): bốn thiền định và bốn không định.",
"120": "Thọ chi đề (Rukkhacetia) là “thọ miếu”, vị thọ thần của Aán Độ tín ngưỡng. Lấy cây làm đối tượng sùng bái, như đối với tháp miếu vậy.",
"121": "Bát Chánh đạo (Ariyam utthangikkhamamagam): chánh kiến (Samaditthi), chánh tư duy (Sammasan-kappa), chánh ngữ (Sammavaca), chánh nghiệp (Samakamanta), chánh mạng (Sammajiva), chánh tinh tấn (Sammavayama), chánh niệm (Samma-sati), chánh định (Samasamadhi). Hai câu này chỉ về đạo diệt khổ, nói gọn là Đạo đế.",
"122": "Nhật bản dịch là An lạc phẩm.",
"123": "Phật tự xưng.",
"124": "Tật bệnh đây chỉ các phiền não thống khổ.",
"125": "Không còn các phiền não chướng như tham, sân, si v.v…",
"126": "Lúc Phật ở tạm nơi thôn của một Bà-la-môn tên Ngũ ta la (Pancasala), một hôm Ngài vô xóm làng khất thực, không gặp ai cúng dường, một kẻ Ma vương đứng ở cửa làng thấy Phật mang bát đi về không, mới cười chọc nói rằng: “Ngài chưa được thực phẩm, ắt phải đi vào thôn xóm khất thực để giải quyết sự đói “. Nhân đó Phật nói bài này.",
"127": "Nguyên văn: Sankhara dịch là hành, tức là pháp hữu vi có sanh diệt, trong Pali chú thích uẩn (khandha).",
"128": "Câu này là câu tiếp liền trên dưới.",
"129": "Những Tỷ-kheo vì bị dục lạc mê hoặc, bỏ việc hành đạo để sinh hoạt theo thế tục, sau thấy kẻ khác tu hành có công quả, lại luống tỏ lòng hâm mộ, chứ tự mình không thành được chi.",
"130": "Năm câu 212-216, theo bản dịch của Đại đức Na-ra-da là: ”From endearment spings gief, from endearment spings fear for him who is free from endearment there is no gief, much less fear. From affection… From delight … From lust…, From craving…“.",
"131": "Chỉ bốn hướng, bốn quả và Niết-bàn, cộng là chín pháp thù thắng.",
"132": "Chỉ bốn Thánh đế.",
"133": "Chỉ giới, định, tuệ.",
"134": "Bậc thượng lưu (Ubddhamsoto), chỉ quả vị Bất hoàn (Anagami) gần đến Niết-bàn A-la-hán.",
"135": "Danh sắc (Namarapa) tức là tinh thần và vật chất, tâm và thân.",
"136": "Nếu tự chủ, ngăn trừ nóng giận kịp thời, mới là người thiện ngự, ngoài ra toàn như kẻ cầm cương hờ, chứ không khống chế được con ngựa.",
"137": "Nguyên văn còn có một chử “thiểu”, ít (Appam), tức là mình có vật gì dù ít, cũng có thể chia sớt cho người đến xin được.",
"138": "A-đa-la (Atula) là tên một người Phật tử xưa.",
"139": "Diêm-phù-kim (jambunaba) là tên đặc biệt để chỉ 1 thứ vàng phẩm chất rất quí. Ý nói vàng này từ sông Diêm-phù (Jambu) mà có.",
"140": "Thánh cảnh hàng chư Thiên đây là chỉ 5 cõi trời Tịch cư (Panca Anddhvasabhumi): Vô phiền (A-viha), Vô nhiệt (Atappa), Thiện hiện (Suddassa), Thiện kiến (Suddssi), Sắc cứu kính (Akanittha) là năm chỗ của hàng A-na-hàm ở.",
"141": "Sa-môn (samano) ở đây chỉ những vị chứng ngộ bốn thánh quả.",
"142": "Nguyên văn: Papanca, gồm có nghĩa hư vọng và chướng ngại. Ở đây đặc biệt chỉ cho Aùi (Tan-ha), Kiến (Ditthi), Mạn (Mano).",
"143": "Pháp trụ (Dhammattha), có nghĩa là thực hành đúng pháp, an trụ phụng thờ đúng pháp, nên cũng dịch là “Phụng pháp”.",
"144": "Lỗ mãng (Sahasa), bao hàm nghĩa cẩu thả, khinh xuất, độc đoán. Ở đây chỉ cho cái quan niệm bất chính xác, bởi chịu ảnh hưởng của tham, sân, si, bố úy mà sinh ra.",
"145": "Do thân (Kayena), nguyên chú thích là “do danh thân” (Namakayena). Trong văn Pali chia năm uẩn ra hai loại: A. Danh thân (Namakayena), tức danh uẩn là thọ, tưởng, hành, thức uẩn; B. Sắc thân (Rupakayena) tức là sắc uẩn. Như vậy, do thân thật thấy Chánh pháp tức là nói do tâm thật thấy Chánh pháp, là do tự nội tâm chứng ngộ Chánh pháp, đích thực, chứ không vịn lấy chỗ ngộ do người làm cho mình ngộ … Chữ thân là một chứa nhóm, đồng nghĩa với chữ uẩn.",
"146": "Trưởng lão (Thera), tiếng tôn xưng người đã giữ giới Tỷ-kheo mười năm trở lên, nhưng vốn trọng về thực tu thực chứng, nếu không thì chỉ là cách gọi suông.",
"147": "Chỉ lý Tứ Đế.",
"148": "Chỉ bốn quả, bốn hướng và Niết-bàn.",
"149": "Chỉ hết thảy giới luật.",
"150": "Đặc biệt chỉ điều phục năm căn: nhãn, nhĩ, tỉ, thiệt, thân.",
"151": "Thiện đây chỉ cái thiện hữu lậu, là cái Thiện làm với tâm bỉ thử ngã nhân.",
"152": "Biết giới, biết định, biết tuệ.",
"153": "Chữ Ariya có nghĩa là hiền đức, cao thượng. Phật đối với người đánh cá tên Ariya mà nói ra bài này.",
"154": "Giới luật đây chỉ cho Biệt giải thoát luật nghi giới, căn bản luật nghi giới. Đầu đà (Dhutanga) là hạnh tu kham khổ, tiết độ trong việc ăn, mặc, ở, để dứt sạch phiền não, gồm có mười hai hạnh, riêng cho một số người tu.",
"155": "Học ba tạng (Tripitaka).",
"156": "Bốn đế (tứ cú): Khổ (dukkha), khổ tập (dukkha-ssamudaya), khổ diệt (dukkhanirodha) khổ diệt đạo (dukkhaniaodhagaminipatipada). Xưa dịch là: khổ, tập, diệt, đạo.",
"157": "Chỉ Niết-bàn.",
"158": "Chỉ Phật-đà. Phật đủ năm mắt: nhục nhãn (namsa-cakkhu), thiên nhãn (dibhacakkhu), huệ nhãn (panna-cakkhu), Phật nhãn (Buddhacakkhu), nhất thế trí nhãn (Samantacakkhu).",
"159": "Tứ đế, Bát chánh đạo, Niết-bàn",
"160": "Chỉ cho tham, sân, si v.v…",
"161": "Các Tăng-già Tích Lan mỗi khi khai một hội nghị để luận bàn việc trọng đại, thường lấy bài này làm khẩu hiệu kêu gọi.",
"162": "Như Lai chỉ bày chánh đạo, còn hành đạo là do người.",
"163": "Tất cả hiện tượng.",
"164": "Du-già (Yoga) tức là định.",
"165": "Thiện Thệ (Sugato) tức là Phật-đà.",
"166": "Chẳng biết sự nguy hiểm về cái chết là cách nào, ở đâu, lúc nào.",
"167": "Chỉ ý nghĩa của bài trên.",
"168": "Hai bài này đều mượn ví dụ để cắt nghĩa.",
"169": "Dụ thường kiến (Sassataditti) và đoạn kiến (Ucc-hedaditthi).",
"170": "Chỉ 12 xứ (dvrdasatana) mắt, tai, mũi, lưỡi, thân, ý, sắc, thinh, hương, vị, xúc, pháp.",
"171": "Chỉ sự dục lạc (nadirago).",
"172": "Chỉ quả vị lậu tận A-la-hán.",
"173": "Hổ tướng thứ năm (veyyagghapancaman) tức bằng với nghi thứ 5 (Vicikicchannivarana). Vì trong năm cái (ngăn, cheancanivarana) thì nghi cái (vicikicchannivarana)ở về thứ 5. Năm cái là: tham dục (kamacchanda), sân nhuế (viavada), hôn trầm thùy miên (thinamiddha), trạo cử ác tác (Uddhaccukukkucca), nghi (Vikicikiccha).",
"174": "Kiều-đáp-ma (Gotama) tức là đức Phật.",
"175": "Sắc thân gồm có 32 thứ bất tịnh: Tóc, lông, móng, răng, da v.v..",
"176": "Thánh tài là gia tài của Thánh giả (nhờ đó mà thành đạo quả), có 7: tín, giới, tàm, quý, văn, xả, huệ.",
"177": "Tuyết sơn (Himayanto) tức Hy mã lạp sơn.",
"178": "Lừa và Ngựa giao hợp với nhau sinh ra con gọi là La.",
"179": "Tín độ (Sidha) là con sông Aán Độ. Giống ngựa Tuấn sinh ở địa phương này.",
"180": "Kiều-la (Kunjara) tên voi.",
"181": "Ý nói người chưa điêu luyện thì tánh hung hăng hơn cả voi ngựa, nhưng khi tu luyện được rồi thì quí hơn nhiều.",
"182": "Voi đến kỳ phát dục thường tiết ra một thứ nước thối tha và tính tình hung hăng khó trị.",
"183": "Cổ tích kể voi có lòng nhớ mẹ nó là có ý để khuyên người ta hãy hiếu thuận cha mẹ.",
"184": "Phật tự xưng.",
"185": "Ái dục có ba thứ: a) Dục ái (kamatanha), b) Hữu ái (Bhavatanha sự ái dục dính líu với thường kiến) c) Phi hữu ái (Vibhavatanha) sự ái dục tương quan với đoạn kiến. Trong sáu căn, ngoài sáu trần, đều là ái, họp thành 12: Dục ái 12,hữu ái 12, phi hữu ái 12, cộng thành 36 ái dục, 36 ái dục thường lưu động không ngừng như dòng nước, nên gọi là dục lưu.",
"186": "Là từ sáu căn phát ra.",
"187": "Chỉ Niết-bàn.",
"188": "Lìa thế dục để xuất gia.",
"189": "Xuất gia rồi lại hoàn tục.",
"190": "Chứng Niết-bàn.",
"191": "Bỏ sự tham đắm theo ngũ uẩn quá khứ, hiện tại và vị lai.",
"192": "Chỉ A-la-hán.",
"193": "Từ đây không còn luân hồi sanh tử nữa.",
"194": "Câu này theo nguyên văn là: Niruttipada Kovido, dịch thẳng là thông đạt và tha cú; tức chỉ cho bốn thứ biện giải vô hại (Catupatisambbida): Nghĩa vô hại (Atha) là thông suốt lý nghĩa; Pháp vô ngại (Dhamma) là thông suốt giáo pháp như 3 tạng 12 bộ; Từ vô hại (Nirutti), là thông suốt lời lẽ văn cú; Biện thuyết vô ngại (Patibhana), là giảng nói (biết thứ lớp của tự, cú, là chỉ môn biện thuyết vô ngại).",
"195": "Sau khi Phật thành đạo, từ Bồ đề tràng đi tới Lộc dã uyển, giữa đường gặp nhà tu của đạo khác, tên Ưu ba ca (Upaka), hỏi Phật rằng: ”Ôâng xuất gia theo ai?” “Thầy ông là ai”? “Ôâng tin tôn giáo nào?” Phật liền nói bài trên để trả lời.",
"196": "Cái đầu nằm ở chổ cao nhất nơi thân ta.",
"197": "Ý nói chỉ hâm mộ việc của người thì chẳng ích gì cho việc của mình.",
"198": "Thuyền dụ thân thể, nước dụ ác tâm phiền nảo.",
"199": "Bỏ năm điều là : Bỏ năm kết sử của hạ giới (ngũ hạ phần kết - Panca orambhagiyasamyaja-nani): Dục giới tham (Khamatogo) là sự tham lam ở tại dục giới ; sân (Vyapado) ; thân kiến (Satka-yaditthi) là chấp thân thật hữu ; giới cấm thủ (Si-labhataparamato) là cố chấp các giới cấm tà vạy ; nghi (Vicikischa).",
"200": "Đoạn 5 điều là : Bỏ năm kiết sử của thượng giới (ngũ thượng phần kiết - panca uddhambha-giyasamiokanani) : Sắc giới tham (Ruparaga) là tham đắm ở tại Sắc giới ; Vô sắc giới tham là tham đắm thiền định ở Vô sắc giới ; Trạo cử (uddhacca) là loạn động ; Mạn (mana) là ngạo mạn ; Vô minh (Avijja).",
"201": "Tu năm điều là tu năm căn lành : tín, tấn, niệm, định, huệ.",
"202": "Ngũ trược, là năm điều say đắm : tham, sân, si, mạn, ác kiến.",
"203": "Bộc lưu là dòng nước lũ (Ogho), chỉ cho 4 thứ : dục lưu, hữu lưu, kiến lưu, vô minh lưu.",
"204": "Bạt tất ca (Vassika), tên một thứ hoa thơm hơn các hoa khác.",
"205": "Bà-la-môn (Bhramana) ở đây là tiếng chỉ chung người hành đạo thanh tịnh, chớ không phải như nghĩa thông thường chỉ riêng về giai cấp đạo sĩ Bà-la-môn. Phẩm này Phật dạy, gọi là Bà-la-môn là cốt ở tư cách xứng đáng của họ, chứ không phải là tại dòng dõi, nơi sinh hay những gì hình thức bên ngoài.",
"206": "Các yếu tố cấu thành sanh mạng.",
"207": "Hai pháp là chỉ và quán.",
"208": "Bờ kia là chỉ sáu căn bên trong (Ajjhatikani cho Ayatanani); Mắt, tai, mũi, lưỡi, thân, ý. Bờ này là chỉ sáu trần bên ngoài (Bahirani cho ayatanani): sắc, thanh, hương, vị, xúc, pháp. Không chấp trước ta và của ta, nên nói là không bờ này, bờ kia.",
"209": "Nguyên văn là: dara, cũng cò thể dịch là bố úy.",
"210": "Ở đây chỉ giáo đồ Bà-la-môn.",
"211": "Chỉ tứ đế.",
"212": "Hạnh phúc (sukhí) bổn của Tích Lan viết là Suci, nên dịch thanh tịnh.",
"213": "Một số ngoại đạo Ấn Độ hay dùng da nai làm đồ trải ngồi và áo mặc.",
"214": "Áo phấn tảo (Pansukula civara), là thứ vải rẻo người ta vứt, người xuất gia lượm lấy giặt sạch chắp lại may áo cà sa mà mặc.",
"215": "Nguyên văn là Bhovadi, tức là Bho-vadi, dịch là “thuyết bồ”. Đây là tiếng tôn xưng nhau của giáo đồ Bà-la-môn dùng riêng với nhau trong khi nói chuyện.",
"216": "Bài này toàn dùng những đồ để khớp ngựa mà ví dụ: Đai da dụ lòng sân nhuế, cương dụ ái dục, dây dụ 62 tà kiến, sở thuộc (dây buộc ngựa) dụ những tập tánh tiềm tàng (anusaysg xưa dịch là “Tùy miên”, có 7 thứ: dục, tham, sân, mạn, ác kiến, nghi, vô minh). Chướng ngại dụ vô minh.",
"217": "Chỉ các phiền não tham dục.",
"218": "Khắc phục ngũ uẩn không cho tái sanh.",
"219": "Nguyên văn là Usabaha, dịch là trâu nái hay trâu chúa. Ở đây hàm chỉ sự thù thắng, là chỉ người hùng mạnh, vô úy, siêu quần.",
"220": "Thắng phục phiền não ma, uẩn ma và tử ma, gọi là người thắng lợi.",
"221": "Người Ấn Độ mê tín nước sông Hằng có thể rửa sạch tội lỗi, nhưng ở đây lại ý nói không còn các cấu nhiễm trong tâm người Bà-la-môn."
  }
